
**Terraform plan** (Okta preview) ran in [3 seconds](https://github.com/evanyeung-clear/terraform-ci/actions/runs/23126669418).
```
terraform-ci plan -no-color -input=false -target=okta_user.service-account-2
```

#### Diff of changes
```diff
+ okta_user.service-account-2 will be created

```

<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.
</summary>

```
[INFO] Starting Terraform preprocessing in terraform environment...
[INFO] Cleaning up existing temporary files...
[INFO] Consolidating .tf files from subdirectories into _consolidated.tf...
[INFO] Consolidated 1 files into _consolidated.tf
[INFO] Source map written to _consolidated_source_map.json
[INFO] Running terraform with arguments: plan -no-color -input=false -target=okta_user.service-account-2
[INFO] Using terraform executable: /usr/local/bin/terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # okta_user.service-account-2 will be created
  + resource "okta_user" "service-account-2" {
      + custom_profile_attributes = (known after apply)
      + email                     = "service2@example.com"
      + expire_password_on_create = false
      + first_name                = "Service"
      + id                        = (known after apply)
      + last_name                 = "Account 2"
      + login                     = "service2@example.com"
      + raw_status                = (known after apply)
      + skip_roles                = false
      + status                    = "ACTIVE"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>
